Enterprise_Serivces/Prod/SilverGroup1/CSLAllSparkService/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://www.gamestop.com/CSL/AllSpark/V1.0">ebab6a4d-4f04-4edb-9211-790a49e9de65</CorrelationID><MachineName xmlns="http://www.gamestop.com/CSL/AllSpark/V1.0">test</MachineName><wsa:Action>http://www.gamestop.com/CSL/AllSpark/V1.0/AllSparkService_v1/GetProductAvailableInventory</wsa:Action><wsa:MessageID>uuid:93448b94-87b6-4134-a54e-52dd3f9a8383</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslallsparkserviceqa1.testgs.pvt/AllSparkService.svc</wsa:To></soap:Header><soap:Body><GetProductAvailableInventoryRequest xmlns="http://www.gamestop.com/CSL/AllSpark/V1.0"><AllSparkID>1893050</AllSparkID><PartnerKey>TEST-US</PartnerKey></GetProductAvailableInventoryRequest></soap:Body></soap:Envelope>